app/Controllers/Admin/Anonymous.php

SELECT `tbl_anonymous`.*, COUNT(tbl_anonymous_has_like.id) AS like_count
FROM `tbl_anonymous`
LEFT JOIN `tbl_anonymous_has_like` ON `tbl_anonymous`.`id` = `tbl_anonymous_has_like`.`anonymous_id`
WHERE `tbl_anonymous`.`is_deleted` = 0
AND `tbl_anonymous`.`is_published` = 1
GROUP BY `tbl_anonymous`.`id`
ORDER BY `id` DESC
---
    public function index()
    {
        if (!session()->get('admin_logged_in')) {
            // maka redirct ke halaman login
            return redirect()->to('/admin/login');
        } else {
            $user_id = session()->get('id');
            $anonymous = new AnonymousModel();
            $data['anonymous'] = $anonymous
                ->select('tbl_anonymous.*, COUNT(tbl_anonymous_has_like.id) AS like_count')
                ->join('tbl_anonymous_has_like', 'tbl_anonymous.id = tbl_anonymous_has_like.anonymous_id', 'left')
                ->where('tbl_anonymous.is_deleted', 0)
                ->where('tbl_anonymous.is_published', 1)
                ->groupBy('tbl_anonymous.id')
                ->orderBy('id', 'desc')
                ->findAll();