app/Controllers/User/Membership.php

SELECT *
FROM `tbl_membership`
WHERE `is_deleted` = 0
---
    public function index()
    {
        if (!session()->get('logged_in')) {
            // maka redirct ke halaman login
            return redirect()->to('login');
        } else {
            $membership = new MembershipModel();
            $data['memberships'] = $membership->where('is_deleted', 0)->findAll();

SELECT *
FROM `tbl_membership`
WHERE `id` = '2'
 LIMIT 1
SELECT *
FROM `tbl_users`
WHERE `id` = '1'
 LIMIT 1
---
    public function checkout($id)
    {
        if (!session()->get('logged_in')) {
            // maka redirct ke halaman login
            return redirect()->to('login');
        } else {
            $membership = new MembershipModel();
            $counselors = new CounselorController();
            $has_member = new HasMembershipModel();
            $user = new UserModel();
            $data['membership'] = $membership->where('id', $id)->first();
            // Fetch membership details
            $hasMembership = $has_member
                ->where('user_id', session()->get('id'))
                ->where('status', 4)
                ->first();

            // Calculate remaining days
            if ($hasMembership) {
                $endDate = new \DateTime($hasMembership['end_date']);
                $today = new \DateTime();
                $remainingDays = $today->diff($endDate)->days;
            } else {
                $remainingDays = 0;
            }
            // Check if membership is active
            $data['has_membership'] = ($remainingDays > 0) ? true : false;
            $data['counselors'] = $counselors->where('is_deleted', 0)->where('role', 2)->findAll();
            $data['user'] = $user->where('id', session()->get('id'))->first();