app/Helpers/user_helper.php

SELECT *
FROM `tbl_users`
WHERE `id` = '1'
 LIMIT 1
---
function get_user_anonym_name($id)
{
    $user = new UserModel();
    $user_data = $user->where('id', $id)->first();

SELECT *
FROM `tbl_membership`
WHERE `id` = '1'
 LIMIT 1
---
function get_membership_name($id)
{
    $membership = new MembershipModel();
    $membership_data = $membership->where('id', $id)->first();

SELECT *
FROM `tbl_membership`
WHERE `id` = '1'
 LIMIT 1
---
function get_membership_cost($id)
{
    $membership = new MembershipModel();
    $membership_data = $membership->where('id', $id)->first();