app/Controllers/Home.php

    public function article()
    {
        $data['title'] = 'ARTICLE';
        $article = new ArticleModel();
        $data['articles'] = $article->where('is_deleted', 0)->where('is_published', 1)->findAll();
---
SELECT *
FROM `tbl_article`
WHERE `is_deleted` = 0
AND `is_published` = 1